# ConfigurationReloadInfo Properties

---
The ConfigurationReloadInfo type exposes the following members.
| Name| Description
---|---|---
| Disconnects|  The number of disconnections caused by the reload.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OutOfDatePartCount|  The number of fabrication part instances that had newer versions and were out of date.
| ProfileNotAvailable|  The current profile is not available in the disk configuration.
Top
#### Reference
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace